wanjin1234/Silent-Mask-Microphone/MLX90640-D110 Thermal/MLX90640-D110 Thermal/Mlx90640-thermal_camera/STM32/lcd_display/mlx90640_hx8347d/Hardware/hx8347d/stm32_hx8347d_lcd.c
/*MIT License
Copyright (c) 2018 imliubo
Github  https://github.com/imliubo
Website https://www.makingfun.xyz
*/

/* File Info : -----------------------------------------------------------------
                                   User NOTES
1. How To use this driver:
--------------------------
   - The LCD hx8347d component driver MUST be included with this driver.  

2. Driver description:
---------------------
  + Initialization steps:
     o Initialize the LCD using the BSP_LCD_Init() function.
  
  + Display on LCD
     o Clear the whole LCD using the BSP_LCD_Clear() function or only one specified 
       string line using the BSP_LCD_ClearStringLine() function.
     o Display a character on the specified line and column using the BSP_LCD_DisplayChar()
       function or a complete string line using the BSP_LCD_DisplayStringAtLine() function.
     o Display a string line on the specified position (x,y in pixel) and align mode
       using the BSP_LCD_DisplayStringAtLine() function.          
     o Draw and fill a basic shapes (dot, line, rectangle, circle, ellipse, ..) 
       on LCD using a set of functions.    
 
------------------------------------------------------------------------------*/

/* Dependencies
- hx8347d.c
- fonts.h
- font24.c
- font20.c
- font16.c
- font12.c
- font8.c"
EndDependencies */
    
/* Includes ------------------------------------------------------------------*/
#include "stdio.h"
#include "main.h"
#include "spi.h"
#include "stm32_hx8347d_lcd.h"
#include "Fonts/fonts.h"
#include "Fonts/font24.c"
#include "Fonts/font20.c"
#include "Fonts/font16.c"
#include "Fonts/font12.c"
#include "Fonts/font8.c"

/** @addtogroup BSP
  * @{
  */

/** @addtogroup STM32_HX8347D
  * @{
  */
    
/** @addtogroup STM32_HX8347D_LCD
  * @{
  */ 

/** @defgroup STM32_HX8347D_LCD_Private_TypesDefinitions
  * @{
  */ 

/**
  * @}
  */ 

/** @defgroup STM32_HX8347D_LCD_Private_Defines
  * @{
  */
#define POLY_X(Z)             ((int32_t)((Points + (Z))->X))
#define POLY_Y(Z)             ((int32_t)((Points + (Z))->Y))
//#define NULL                  (void *)0

#define MAX_HEIGHT_FONT         24
#define MAX_WIDTH_FONT          17
#define OFFSET_BITMAP           54
/**
  * @}
  */ 

/** @defgroup STM32_HX8347D_LCD_Private_Macros
  * @{
  */
#define ABS(X) ((X) > 0 ? (X) : -(X)) 

/**
  * @}
  */ 
    
/** @defgroup STM32_HX8347D_LCD_Private_Variables
  * @{
  */ 
LCD_DrawPropTypeDef DrawProp;

static LCD_DrvTypeDef  *lcd_drv; 

/* Max size of bitmap will based on a font24 (17x24) */
static uint8_t bitmap[MAX_HEIGHT_FONT*MAX_WIDTH_FONT*2+OFFSET_BITMAP] = {0};

/*  Rotation  */
static uint8_t _rotation = 0;

/**
  * @}
  */ 

/** @defgroup STM32_HX8347D_LCD_Private_FunctionPrototypes
  * @{
  */ 
static void DrawChar(uint16_t Xpos, uint16_t Ypos, const uint8_t *c, uint16_t RGBCode);
static void SetDisplayWindow(uint16_t Xpos, uint16_t Ypos, uint16_t Width, uint16_t Height);
/**
  * @}
  */ 
//=========================================================1=============================================================//
/** @defgroup STM32F1XX_NUCLEO_Private_Functions STM32F1XX NUCLEO Private Functions
  * @{
  */ 
static void  SPIx_Init(void);
static uint16_t SPIx_Read(uint8_t Value);
static void  SPIx_Write(uint8_t Value);
static void  SPIx_Error (void);
static void  SPIx_MspInit(void);


uint32_t SpixTimeout = NUCLEO_SPIx_TIMEOUT_MAX;  

//=========================================================2=============================================================//
/** @defgroup STM32_HX8347D_LCD_Private_Functions
  * @{
  */
  
/**
  * @brief  Initializes the LCD.
  * @param  None
  * @retval LCD state
  */
uint8_t BSP_LCD_Init(void)
{ 
  uint8_t ret = LCD_ERROR;
  
  /* Default value for draw propriety */
  DrawProp.BackColor = 0xFFFF;
  DrawProp.pFont     = &Font24;
  DrawProp.TextColor = 0x0000;
  
  lcd_drv = &hx8347d_drv;
	
	LCD_IO_Init();
  /* LCD Init */   
  lcd_drv->Init();
  
	BSP_LCD_SetRotation(1);
  /* Clear the LCD screen */
  BSP_LCD_Clear(LCD_COLOR_WHITE);
  
  /* Initialize the font */
  BSP_LCD_SetFont(&LCD_DEFAULT_FONT);
  
  ret = LCD_OK;
  
  return ret;
}

/**
  * @brief  Gets the LCD X size.
  * @param  None    
  * @retval Used LCD X size
  */
uint32_t BSP_LCD_GetXSize(void)
{
  return(lcd_drv->GetLcdPixelWidth());
}

/**
  * @brief  Gets the LCD Y size.
  * @param  None   
  * @retval Used LCD Y size
  */
uint32_t BSP_LCD_GetYSize(void)
{
  return(lcd_drv->GetLcdPixelHeight());
}

/**
  * @brief  Gets the LCD text color.
  * @param  None 
  * @retval Used text color.
  */
uint16_t BSP_LCD_GetTextColor(void)
{
  return DrawProp.TextColor;
}

/**
  * @brief  Gets the LCD background color.
  * @param  None
  * @retval Used background color
  */
uint16_t BSP_LCD_GetBackColor(void)
{
  return DrawProp.BackColor;
}

/**
  * @brief  Sets the LCD text color.
  * @param  Color: Text color code RGB(5-6-5)
  * @retval None
  */
void BSP_LCD_SetTextColor(uint16_t Color)
{
  DrawProp.TextColor = Color;
}

/**
  * @brief  Sets the LCD background color.
  * @param  Color: Background color code RGB(5-6-5)
  * @retval None
  */
void BSP_LCD_SetBackColor(uint16_t Color)
{
  DrawProp.BackColor = Color;
}

/**
* @brief  Set the Rotation.
* @param  rotation: 0(0бу), 1(90бу), 2(180бу), 3(270бу)
* @retval None
*/
void BSP_LCD_SetRotation(uint8_t rotation)
{
	if(lcd_drv->SetRotation != NULL)
  {
		_rotation = rotation%4;
    lcd_drv->SetRotation(rotation);
  }
}
/**
  * @brief  Sets the LCD text font.
  * @param  fonts: Font to be used
  * @retval None
  */
void BSP_LCD_SetFont(sFONT *pFonts)
{
  DrawProp.pFont = pFonts;
}

/**
  * @brief  Gets the LCD text font.
  * @param  None
  * @retval Used font
  */
sFONT *BSP_LCD_GetFont(void)
{
  return DrawProp.pFont;
}

/**
  * @brief  Clears the hole LCD.
  * @param  Color: Color of the background
  * @retval None
  */
void BSP_LCD_Clear(uint16_t Color)
{ 
  uint32_t counter = 0;
	
	if(_rotation == 0 || _rotation == 2){
		for(counter = 0; counter < BSP_LCD_GetYSize(); counter++)
		{
			BSP_LCD_DrawHLine(0, counter, BSP_LCD_GetXSize(),Color);
		}
	}else{
		for(counter = 0; counter < BSP_LCD_GetYSize(); counter++)
		{
			BSP_LCD_DrawHLine(0, counter, BSP_LCD_GetXSize(),Color);
		}
	}

